#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.dependencies_layer: Refreshing state... [id=5820910839112050069]
random_string.random: Refreshing state... [id=sZHL]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=dfbb58116cc18ec285bf84abe4b511917b9ea314]
aws_apigatewayv2_api.http_lambda: Refreshing state... [id=exj5m66tib]
aws_iam_role.lambda_exec: Refreshing state... [id=LambdaDdbPost]
aws_sns_topic.budget_notification: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_dynamodb_table.paste: Refreshing state... [id=paste]
aws_iam_policy.lambda_exec_role: Refreshing state... [id=arn:aws:iam::127449185323:policy/lambda-tf-pattern-ddb-post]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/pastebin-sZHL]
aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/pastebin-sZHL]
aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:6]
aws_sns_topic_subscription.email_subscription: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic:6fac9d94-197f-4a31-b6ee-8c9702c91d24]
aws_cloudwatch_metric_alarm.budget_alarm: Refreshing state... [id=MonthlyChargeAlarm]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=LambdaDdbPost-20231223010623714500000001]
aws_s3_bucket_ownership_controls.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_s3_object.this: Refreshing state... [id=src.zip]
aws_s3_bucket_acl.private_bucket: Refreshing state... [id=pastebin20231223003519593600000001,private]
aws_lambda_function.apigw_lambda_ddb: Refreshing state... [id=pastebin-sZHL]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.apigw_lambda: Refreshing state... [id=v3fnxm6]
aws_apigatewayv2_route.get: Refreshing state... [id=jyrrkzs]
aws_apigatewayv2_route.options: Refreshing state... [id=wyq0020]
aws_apigatewayv2_route.post: Refreshing state... [id=3h7xv4f]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.apigw_lambda_ddb will be updated in-place
  ~ resource "aws_lambda_function" "apigw_lambda_ddb" {
        id                             = "pastebin-sZHL"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:6",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-02-01T00:18:15.920+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "h4CEGF+rGZG0C+cdnIo5FUCt5VEPfqQbg1Zdoqhs5pU=" -> "OuCKquuiuDnoGU0xln/UUcczDSwvC6eklk0rQQKq+AI=" # forces replacement
      ~ source_code_size            = 17002690 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.email_subscription will be updated in-place
  ~ resource "aws_sns_topic_subscription" "email_subscription" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ endpoint                        = (sensitive value)
        id                              = "arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic:6fac9d94-197f-4a31-b6ee-8c9702c91d24"
        # (9 unchanged attributes hidden)
    }

  # null_resource.dependencies_layer must be replaced
-/+ resource "null_resource" "dependencies_layer" {
      ~ id       = "5820910839112050069" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_file" = "$HOME/.local/share/virtualenvs/pastebin-98kiCtZv/lib" -> "../.venv/lib"
            # (1 unchanged element hidden)
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  - budget_alarm_email       = "socdev@dev.com" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @socraticDevBlog, Action: `pull_request`*